# WorksetTable Properties

---
The WorksetTable type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
WorksetTable Class
Autodesk.Revit.DB Namespace